In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\pc\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\pc\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [32]:
import pandas as pd
students_data=[{"id":1 ,"name":"Alice" ,"Age":20 ,"Grade":"A" ,"Marks":85},
               {"id":2 ,"name":"Bob" ,"Age":22 ,"Grade":"B" ,"Marks":78} ,
               {"id":3 ,"name":"charlie" ,"Age":19 ,"Grade":"A" ,"Marks":92},
               {"id":4 ,"name":"david" ,"Age":21 ,"Grade":"c" ,"Marks":65},
               {"id":5 ,"name":"eva" ,"Age":20 ,"Grade":"B" ,"Marks":74}]
df= pd.DataFrame(students_data) 
df

   id     name  Age Grade  Marks
0   1    Alice   20     A     85
1   2      Bob   22     B     78
2   3  charlie   19     A     92
3   4    david   21     c     65
4   5      eva   20     B     74

In [27]:
df.head(3)

      name  Marks
0    Alice     85
1      Bob     78
2  charlie     92

In [26]:
df= pd.DataFrame(students_data ,columns=["name" , "Marks"])
df

      name  Marks
0    Alice     85
1      Bob     78
2  charlie     92
3    david     65
4      eva     74

In [40]:
df.loc[df["Grade"] =="A"]

   id     name  Age Grade  Marks
0   1    Alice   20     A     85
2   3  charlie   19     A     92